[판다스 300제] <hr>

In [154]:

import pandas as pd
import numpy as np

In [155]:
# [51 ~ 60]
pd1=pd.Series([100,200,300])

In [156]:
pd1.index=['철수','영희','아름']

In [157]:
pd1=pd.DataFrame({'점수':[100,200,300]},index=['철수','영희','아름'])

In [158]:
pd1=pd.DataFrame({'점수':[100,200,300]},index=['철수','영희','아름'])

In [159]:
a={'종목명':['삼성전자','셀트리온','카카오','삼성전자우','현대바이오'],'종가':[73000,356000,367000,68600,34150]}
pd1=pd.DataFrame(a)
pd1.set_index('종목명')

           종가
종목명
삼성전자    73000
셀트리온   356000
카카오    367000
삼성전자우   68600
현대바이오   34150

In [160]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s.index

Index(['철수', '영희', '아름'], dtype='object')

In [161]:
s.values

array([100, 200, 300])

In [162]:
s.to_dict()

{'철수': 100, '영희': 200, '아름': 300}

In [163]:
s.to_excel('data.xlsx')

In [164]:
# [61 ~ 70]
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s.dtype

dtype('int64')

In [165]:
data = [  10,  "가" ]
s = pd.Series( data )
s.dtype

dtype('O')

In [166]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s.index.dtype

dtype('O')

In [167]:
data = {
    "2020-12-11": 73400,
    "2020-12-10": 72900,
    "2020-12-09": 73900,
    "2020-12-08": 71700,
    "2020-12-07": 72900
}

s = pd.Series(data)
s.name="종가"
s.index.name='날짜'
pd.DataFrame(s)

               종가
날짜
2020-12-11  73400
2020-12-10  72900
2020-12-09  73900
2020-12-08  71700
2020-12-07  72900

In [168]:
data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s.to_dict()

{'apple': 1500, 'banana': 3000}

In [169]:
data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s.index.name='icecream'
s

icecream
apple     1500
banana    3000
dtype: int64

In [170]:
s = pd.Series(data=[1, 2, 3])
s.name='number'
s.name

'number'

In [171]:
s = pd.Series([1, 2, 3])
s.to_numpy

<bound method IndexOpsMixin.to_numpy of 0    1
1    2
2    3
dtype: int64>

In [172]:
s.array

<NumpyExtensionArray>
[np.int64(1), np.int64(2), np.int64(3)]
Length: 3, dtype: int64

In [173]:
# [71 ~ 80]
s = pd.Series([1, 2, 'python'])
print(s.dtype)

object

In [174]:
s = pd.Series(['1', '2', '3'])
s.astype('int')

0    1
1    2
2    3
dtype: int64

In [175]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = pd.Series(data, index)
s['영희']

np.int64(200)

In [176]:
s.loc['영희']

np.int64(200)

In [177]:
s[s.index[1]]

np.int64(200)

In [178]:
s[['철수','영희']]

철수    100
영희    200
dtype: int64

In [179]:
data = [100, 200, 300, 400, 500, 600]
index = ["08/01", "08/02", "08/03", "08/04", "08/05", "08/06"]
s = pd.Series(data, index)
s.head(3).index

Index(['08/01', '08/02', '08/03'], dtype='object')

In [180]:
data = [100, 200, 300, 400, 500, 600] 
index = ["08/01", "08/02", "08/03", "08/04", "08/05", "08/06"] 
s = pd.Series(data, index)
s.iloc[::2]

08/01    100
08/03    300
08/05    500
dtype: int64

In [181]:
# [91 ~ 100]
pd.DataFrame({'이름':['김은수','박정민','이하나'],'나이':[35,30,28],'직책':['과장','대리','대리']})

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [182]:
pd.DataFrame([['김은수',35,'과장'],['박정민',30,'대리'],['이하나',28,'대리']],columns=['이름','나이','직책'])

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

In [183]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드')

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [184]:
index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]
pd.DataFrame(data,index=index,columns=columns)

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [185]:
index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]
df = pd.DataFrame(data=data, index=index, columns=columns)
df.reset_index()

    index    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [186]:
d = {'col1': [1, 2], 'col2': [3, 4]}
d=pd.DataFrame(d,dtype='int8')
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    2 non-null      int8
 1   col2    2 non-null      int8
dtypes: int8(2)
memory usage: 132.0 bytes

In [187]:
# [101 ~ 110]
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df['현재가']

종목코드
037730    1510
036360    1790
005760    1185
Name: 현재가, dtype: int64

In [188]:
df[['현재가','등락률']]

         현재가   등락률
종목코드
037730  1510  7.36
036360  1790  1.65
005760  1185  1.28

In [189]:
df.iloc[0]

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [190]:
df.iloc[0:3:2]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [191]:
df.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [192]:
df.iloc[0:3:2]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [193]:
df.iloc[0,-1]
df.iat[0,2]

np.float64(7.36)

In [194]:
# [111 ~ 120]
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df.loc['037730','등락률']

np.float64(7.36)

In [195]:
df.iloc[:2]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [196]:
df.loc[df.index[0]:df.index[1]]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [197]:
df.iloc[:,0]

종목코드
037730       3R
036360    3SOFT
005760     ACTS
Name: 종목명, dtype: object

In [198]:
df.loc[:,df.columns[0]]

종목코드
037730       3R
036360    3SOFT
005760     ACTS
Name: 종목명, dtype: object

In [199]:
df.iloc[0,:2]

종목명      3R
현재가    1510
Name: 037730, dtype: object

In [200]:
df.loc[:df.index[1],:df.columns[1]]

          종목명   현재가
종목코드
037730     3R  1510
036360  3SOFT  1790

In [201]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df.loc[df['현재가']>=1500]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [202]:
df.loc[(df['현재가']>=1500) & (df['현재가']<1700) ]

       종목명   현재가   등락률
종목코드
037730  3R  1510  7.36

In [203]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)
df['목표가']=df['현재가']*1.1
df.drop('목표가',axis=1)

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [204]:
df.loc['066570']=pd.Series(['LG전자','6000','3.84'])
df

          종목명     현재가   등락률     목표가
종목코드
037730     3R  1510.0  7.36  1661.0
036360  3SOFT  1790.0  1.65  1969.0
005760   ACTS  1185.0  1.28  1303.5
066570    NaN     NaN   NaN     NaN

In [205]:
df = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"])
df.columns=list(map(lambda x:x.lower(),df.columns))

In [206]:
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df.index.name='year'
df.columns.name='company'
df

company    카카오  NAVER
year
2019       NaN     52
2020     221.0     47
2021      35.0      3

In [207]:
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df
df.sort_index(axis=1,ascending=False)

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [208]:
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]
df = pd.DataFrame(data=data, index=index)
df.drop('NAVER',axis=1)

        카카오
2019    NaN
2020  221.0
2021   35.0

In [209]:
# [131 ~ 140]
data = [
    {"cd":"A060310", "nm":"3S", "close":"2,920"},
    {"cd":"A095570", "nm":"AJ네트웍스", "close":"6,250"},
    {"cd":"A006840", "nm":"AK홀딩스", "close":"29,700"},
    {"cd":"A054620", "nm":"APS홀딩스", "close":"19,400"}
]
df = pd.DataFrame(data=data)
df['cd']=df['cd'].str[1:]
df

       cd      nm   close
0  060310      3S   2,920
1  095570  AJ네트웍스   6,250
2  006840   AK홀딩스  29,700
3  054620  APS홀딩스  19,400

In [210]:
data = [
    [1, 2, 3],
    [np.nan, 5, 6],
    [7, np.nan, 9],
    [10, 11, np.nan]
]
df = pd.DataFrame(data)
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [211]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)
df.dropna(subset='col2')

   col0  col1  col2
1    10   NaN  10.0
2     2   3.0   4.0

In [212]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)
df.fillna(0)

   col0  col1  col2
0     1   1.0   0.0
1    10   0.0  10.0
2     2   3.0   4.0

In [213]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)
df.ffill()

   col0  col1  col2
0     1   1.0   NaN
1    10   1.0  10.0
2     2   3.0   4.0

In [214]:
data = [
    [1, 1, np.nan],
    [10, np.nan, 10],
    [2, 3, 4]
]
columns = ['col0', 'col1', 'col2']
df = pd.DataFrame(data, columns=columns)
df.isna()

    col0   col1   col2
0  False  False   True
1  False   True  False
2  False  False  False

In [215]:
df.notna()

   col0   col1   col2
0  True   True  False
1  True  False   True
2  True   True   True

In [216]:
data = np.arange(9).reshape(3, 3)
df = pd.DataFrame(data)
df.replace(0,100)

     0  1  2
0  100  1  2
1    3  4  5
2    6  7  8

In [220]:
data = {
    'fruit': ['apple', 'orange', 'orange', 'apple', 'apple', 'apple'],
    'weight': [1.5, 1.3, 3.7, 2.4, 1.7, 1.8]
}
df = pd.DataFrame(data)
df['fruit']=df['fruit'].astype('category')